BusinessProcesses/БизнесПроцесс_ПривязкаДолжника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<BusinessProcess>
		<Properties>
			<Name>БизнесПроцесс_ПривязкаДолжника</Name>
			<Task>Task.ЗадачаПривязкаДолжника</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Контакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/ПривязкаСотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаСотрудник</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПередачаДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПередачаДолжников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Передачи</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтдел</xr:Item>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>InformationRegister.Выезд</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятиеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередачаВСвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольОтдела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольОтдела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

BusinessProcesses/БизнесПроцесс_ПривязкаДолжника/Ext/ObjectModule.bsl
Процедура ЕстьЛиПривязкаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	   спрСтатусОбещаниеОплатить=Справочники.Статусы.НайтиПоНаименованию("Обещание оплатить");
	   спрСтатусПрогноз=Справочники.Статусы.НайтиПоНаименованию("Прогноз");
	   спрСтатусОставленаИнформация=Справочники.Статусы.НайтиПоНаименованию("Оставлена информация");
	   спрСотрРезерв=Справочники.Сотрудники.НайтиПоНаименованию("РЕЗЕРВ",Истина);
	   спрСотрПуст=Справочники.Сотрудники.НайтиПоКоду("000000035");
		   
	   
	   
	   
	   Результат=Истина;
	   
	   Если (Контакт.Статус.Наименование=спрСтатусОбещаниеОплатить.Наименование) ИЛИ (Контакт.Статус.Наименование=спрСтатусПрогноз.Наименование) ИЛИ (Контакт.Статус.Наименование=спрСтатусОставленаИнформация.Наименование)   Тогда
		    
		   //  Проверить тек исполнитель - есть привязка
						   
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ПривязкаСотрудникСрезПоследних.Должник КАК Должник,
							|	ПривязкаСотрудникСрезПоследних.Сотрудник КАК Сотрудник
							|ИЗ
							|	РегистрСведений.ПривязкаСотрудник.СрезПоследних(, Должник = &Должник) КАК ПривязкаСотрудникСрезПоследних";
						
						Запрос.УстановитьПараметр("Должник",Контакт.Должник);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
					
						кол=ВыборкаДетальныеЗаписи.Количество();
						
						Если кол=0 Тогда
						  // Создать документ Передача должника
						  
						       Результат=Ложь;
						
						КонецЕсли;
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Если ВыборкаДетальныеЗаписи.Сотрудник=спрСотрРезерв Тогда
							    Результат=Ложь;
							
							КонецЕсли;
							
								Если ВыборкаДетальныеЗаписи.Сотрудник=спрСотрПуст Тогда
							    Результат=Ложь;
							
							КонецЕсли;
						
							
							
						КонецЦикла;
						
	   
	   КонецЕсли;
	
	
КонецПроцедуры

Процедура СоздатьПривязкуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	   спрОтдел=Справочники.Отделы.НайтиПоНаименованию("Call-центр",Истина);
	   спрСотрМенеджер=Справочники.Сотрудники.НайтиПоНаименованию("Марин_Евгений",Истина);
	   
	
	    массивСтр=ПолучитьДоговораДолжников(Контакт.Должник);
		
		НовыйДокумент = Документы.ПередачаДолжников.СоздатьДокумент();
		НовыйДокумент.Отдел=спрОтдел;
		НовыйДокумент.Дата=ТекущаяДата();
		НовыйДокумент.Сотрудник=Контакт.Сотрудник;
		НовыйДокумент.Менеджер=спрСотрМенеджер;
		НовыйДокумент.Автор=спрСотрМенеджер;
		НовыйДокумент.Комментарий="Создан из Контакта - БП";
		НовыйДокумент.Подписан=Истина;
		
		
		Для каждого стр  Из массивСтр Цикл
		
			 новЗапись= НовыйДокумент.Должники.Добавить();
			 новЗапись.Должник=Контакт.Должник;
			 новЗапись.Договор=стр;
		
		КонецЦикла;
		
	    		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		
	
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДоговораДолжников(долж)
	
	 массивСтр=Новый Массив;
	
	   
	   
	    			Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	Договоры.Ссылка КАК Ссылка
						|ИЗ
						|	Справочник.Договоры КАК Договоры
						|ГДЕ
						|	Договоры.Владелец = &Владелец";
					
					Запрос.УстановитьПараметр("Владелец", долж);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						  
						  массивСтр.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
						   
			            			
						
					КонецЦикла;
					
	Возврат массивСтр;				
					
	

КонецФункции // ()
